{
  "iphone  15+||amazon": {
    "reviews": [
      "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography\nRead more",
      "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography",
      "The camera quality is excellent — especially for photos in low light — and the battery life easily lasts me a full day. Performance is smooth and fast, nice sound quality, bought for a better price",
      "I recently purchased the iPhone 15 in Pink from Amazon, and I couldn’t be happier with my decision! From the moment I unboxed it, the sleek design and soft pastel pink color caught my attention—it looks even better in person than in pictures. Phone is lightweight aluminum and glass build, making the phone feel premium yet comfortable to hold. The pink shade is elegant and subtle, perfect for anyone who loves a touch of sophistication. The 6.1-inch Super Retina XDR display is bright, sharp, and offers vibrant colors. Whether watching videos or scrolling through social media, the experience is smooth and immersive. The 48MP main camera and 12MP ultra-wide lens take incredible photos, even in low light. The details, sharpness, and colors are truly impressive. Portrait mode works beautifully, capturing professional-looking shots effortlessly. The front camera is equally good for selfies and FaceTime. Charging with the USB-C port is much more convenient than before, and fast charging is a plus. The delivery was fast and secure, with the iPhone arriving in perfect condition. The packaging was intact, and setting up the phone was a breeze. If you're looking for a stylish, powerful, and reliable phone, the iPhone 15 in Pink is a fantastic choice.",
      "The iPhone 15 is a noticeable step up from previous models. The design feels premium, and the new green color is subtle yet refreshing. Performance is smooth — apps launch instantly, and multitasking is seamless. The camera system is excellent, especially in low light, and photos come out crisp and vibrant. Battery life easily lasts a full day, even with heavy use. The display is bright and clear, perfect for watching videos or browsing. If you're upgrading from an older iPhone, the iPhone 15 feels like a worthy investment. It’s reliable, fast, and beautifully designed.",
      "It is the best phone out there in the market and runs smoothly. Worth every penny and is very strong.",
      "Very nice device I would say its a good decision. Not because its apple but the build quality, camera quality and other things they offer. It makes it very reliable and good product.",
      "Good one Iphone",
      "Goood phone for the price if u into apple . Great cameras it’s nice to have a proper 2x zoom on normal variant and not loosing much quality and it also nice to have usb c and it charge okey speed . But whenever I play games it heats up (not soo hot but hot enough to know) fast that’s the only issue I faced using this phone"
    ],
    "last_scraped": 1757064112
  },
  "iphone  15+||flipkart": {
    "reviews": [],
    "last_scraped": 1757064138
  },
  "iphone 14||amazon": {
    "reviews": [
      "Nice",
      "Apple iPhone 14 (128 GB) in Midnight is an impressive smartphone that combines elegance with top-notch performance. Its sleek design, vibrant Super Retina XDR display, and powerful A15 Bionic chip deliver a smooth and responsive experience. The improved camera system captures stunning photos and videos, even in low light, making it perfect for photography enthusiasts. Battery life is reliable for all-day use, and the 128 GB storage is ample for most users.\n\nPros:\nStunning display and sleek design\nExceptional camera performance\nSmooth and powerful performance with the A15 chip\nReliable battery life\n\nCons:\nLacks a major design overhaul compared to its predecessor\nNo ProMotion (120 Hz refresh rate)\n\nThe iPhone 14 is a fantastic choice for those seeking a dependable, high-performance smartphone with premium features.\nRead more",
      "Apple iPhone 14 (128 GB) in Midnight is an impressive smartphone that combines elegance with top-notch performance. Its sleek design, vibrant Super Retina XDR display, and powerful A15 Bionic chip deliver a smooth and responsive experience. The improved camera system captures stunning photos and videos, even in low light, making it perfect for photography enthusiasts. Battery life is reliable for all-day use, and the 128 GB storage is ample for most users.\n\nPros:\nStunning display and sleek design\nExceptional camera performance\nSmooth and powerful performance with the A15 chip\nReliable battery life\n\nCons:\nLacks a major design overhaul compared to its predecessor\nNo ProMotion (120 Hz refresh rate)\n\nThe iPhone 14 is a fantastic choice for those seeking a dependable, high-performance smartphone with premium features.",
      "My friend gifted this to his wife.... As per him it is a good phone",
      "About the phone\nApple phone without a second delay, I would say it is better than all android phones I have used. The phone is like water, it flows in a way you want and shaping in your way. In a best way possible, the phone is designed to only show what the user wants and eliminating unnecessary ads, features that I have seen in android.\n\nWhy it is better than Android?\nYou pay too much money for Apple products, obviously you experience the features, physical components , camera lens etc. Apart from basic things, you can also enjoy the best applications available in app store. If you are a developer you might know the app store policy for application publish and their security posture towards handling payment apps etc. They publish best application and the way the apps, its modules switches is just flawless. Due to the so called strict policy of privacy program with Apple products, iPhone can pop up a box in your screen if any apps wants to track your activity with other applications. +1 respect for apple to show such concern with user.\n\nApple phones are same ? like 13 vs 14\nThe reason 14 is same as 13 may be business practice followed from 11th edition. But please note that iPhone making changes internally like physical components (small change in battery performance, lens in 14 edition), additional features but that may not satisfy you to buy 14 edition. If you do not find \"the very few changes\" interesting in 14, go for 13. Because physical and even cameras are not visually very much different in 13 vs 14 comparison. Also you get 13 for cheap :)\n14 is just added features but that is not for daily use, the features real time use is rare case. But the best part is there is no extra cost between 13 vs 14 prices (except extra 10k slash)\n\nConcern you must have.\nApple is not giving chargers and their silicon cases are very expensive (but very good in touch and scratch friendly in back due to silk layer). This is an issue for sure. You have to buy charger not coming with USB C and claiming that you help carbon footprint, understandable but not customer friendly business model. Even after the purchase I had to spend at least 7k for charger and case.\n\nApple care.\nI am not buying it, I pay for phone which is already expensive for this premium and apple care does have strict policy that if you understand that is waste. Instead I find a private insurance to make things better.\nRead more",
      "About the phone\nApple phone without a second delay, I would say it is better than all android phones I have used. The phone is like water, it flows in a way you want and shaping in your way. In a best way possible, the phone is designed to only show what the user wants and eliminating unnecessary ads, features that I have seen in android.\n\nWhy it is better than Android?\nYou pay too much money for Apple products, obviously you experience the features, physical components , camera lens etc. Apart from basic things, you can also enjoy the best applications available in app store. If you are a developer you might know the app store policy for application publish and their security posture towards handling payment apps etc. They publish best application and the way the apps, its modules switches is just flawless. Due to the so called strict policy of privacy program with Apple products, iPhone can pop up a box in your screen if any apps wants to track your activity with other applications. +1 respect for apple to show such concern with user.\n\nApple phones are same ? like 13 vs 14\nThe reason 14 is same as 13 may be business practice followed from 11th edition. But please note that iPhone making changes internally like physical components (small change in battery performance, lens in 14 edition), additional features but that may not satisfy you to buy 14 edition. If you do not find \"the very few changes\" interesting in 14, go for 13. Because physical and even cameras are not visually very much different in 13 vs 14 comparison. Also you get 13 for cheap :)\n14 is just added features but that is not for daily use, the features real time use is rare case. But the best part is there is no extra cost between 13 vs 14 prices (except extra 10k slash)\n\nConcern you must have.\nApple is not giving chargers and their silicon cases are very expensive (but very good in touch and scratch friendly in back due to silk layer). This is an issue for sure. You have to buy charger not coming with USB C and claiming that you help carbon footprint, understandable but not customer friendly business model. Even after the purchase I had to spend at least 7k for charger and case.\n\nApple care.\nI am not buying it, I pay for phone which is already expensive for this premium and apple care does have strict policy that if you understand that is waste. Instead I find a private insurance to make things better.",
      "The Apple iPhone 14 is overall a great phone for anyone who is looking for high speed, excellent camera quality, and a day-long of battery life. The squared-off sides are more comfortable to hold in your hand in my opinion. I purchased this one and so far my experience has been wonderful. Something I like about this phone is its fast speed along with the different options the camera gives you. I wouldn't say the iPhone 14 has a better camera than the 13, rather I think they are more similar and there wasn't a dramatic improvement. The battery life is something that I wish was a little longer. It last about an hour or two more than the average iPhone 13, but does charge faster. I have been able to receive about a 50% charge in 30 minutes. Another great feature of this phone is the painless eSIM setup. Being able to set up the SIM card virtually and not a physical transfer on your phone makes carrying over carriers from phone to phone much easier. battery lasts as long as the iPhone 13. As you may remember, it was much better than the iPhone 12. The iPhone 14 is a smooth, responsive phone and great for high-quality gaming or photo and video editing. Overall I think this is a great phone to purchase if you are looking for a durable and sustainable upgrade and I do think it is worth the extra hundred dollars from the 13.",
      "Achcha hai",
      "Why did you pick this product vs others?:\nIt was awesome",
      "This is 2nd time the display went off by itself , these iPhone are costly but with no reliability, please stop buying and tech Apple a lesson.",
      "اصلي شكرا للتأجير"
    ],
    "last_scraped": 1757064213
  },
  "iphone 14||flipkart": {
    "reviews": [],
    "last_scraped": 1757064454
  },
  "iphone 13||amazon": {
    "reviews": [
      "I snagged the iPhone 13 during the Great Indian Festival for an unbeatable price of 45,000, and let me tell you, it's been a game-changer in every way!\n\nScreen: The display is absolutely stunning – crisp, vibrant, and the colors pop like never before. Watching videos or scrolling through photos is a treat for the eyes. No complaints here!\n\nHanging: Zero issues with hanging or lagging. This phone handles multitasking like a champ. Switching between apps is smooth, and I haven't experienced any frustrating delays.\n\nBattery: The battery life is surprisingly impressive. I can go a full day with normal usage, and it still has juice left in the tank. No more anxiously searching for a charger midday – a definite win!\n\nComfort: The sleek design makes it a pleasure to hold, and the phone is just the right weight. It feels premium and comfortable in my hand, making it a joy to use for extended periods.\n\nImage Quality: The camera on the iPhone 13 is a true standout. The photos are sharp, and the night mode is a game-changer for capturing memories in low light. Selfies have never looked this good!\n\nColor: I went for the classic Midnight color, and it's elegant and timeless. The finish adds a touch of sophistication, and it doesn't attract fingerprints like some other phones I've had in the past.\n\nIn summary, getting the iPhone 13 during the Great Indian Festival was an absolute steal. From the incredible screen to the reliable battery life and stunning camera, it's exceeded my expectations. If you're on the fence, take the plunge – you won't be disappointed.\nRead more",
      "I snagged the iPhone 13 during the Great Indian Festival for an unbeatable price of 45,000, and let me tell you, it's been a game-changer in every way!\n\nScreen: The display is absolutely stunning – crisp, vibrant, and the colors pop like never before. Watching videos or scrolling through photos is a treat for the eyes. No complaints here!\n\nHanging: Zero issues with hanging or lagging. This phone handles multitasking like a champ. Switching between apps is smooth, and I haven't experienced any frustrating delays.\n\nBattery: The battery life is surprisingly impressive. I can go a full day with normal usage, and it still has juice left in the tank. No more anxiously searching for a charger midday – a definite win!\n\nComfort: The sleek design makes it a pleasure to hold, and the phone is just the right weight. It feels premium and comfortable in my hand, making it a joy to use for extended periods.\n\nImage Quality: The camera on the iPhone 13 is a true standout. The photos are sharp, and the night mode is a game-changer for capturing memories in low light. Selfies have never looked this good!\n\nColor: I went for the classic Midnight color, and it's elegant and timeless. The finish adds a touch of sophistication, and it doesn't attract fingerprints like some other phones I've had in the past.\n\nIn summary, getting the iPhone 13 during the Great Indian Festival was an absolute steal. From the incredible screen to the reliable battery life and stunning camera, it's exceeded my expectations. If you're on the fence, take the plunge – you won't be disappointed.",
      "We're pretty confident when we say that the iPhone 13 is the best iPhone for most people. It may look like Apple has only changed the position of one of the phone's back cameras since last year's model, but trust us when we say that there are more substantial upgrades than that. With a new display, larger battery, and better camera hardware and software, the iPhone 13 is the new benchmark for flagship phones.\n\nOnce again, Apple's made the iPhone 13 far more powerful than its Android competitors thanks to its 5G-ready A15 Bionic chip. If the raw performance doesn't interest you, photographers can play with the new Photographic Style filters in the camera app, while videographers will be excited by the new Cinematic mode focus-racking ability.\n\nThe regular iPhone 13 has some flaws. The charging is still relatively slow compared to some Android phones. And I don't like that only the iPhone 13 Pro models get a 120Hz display and telephoto zoom. But based on my in-depth iPhone 13 review, this new iPhone is the best phone for the money.\n\nThe overall display quality continues to be stellar. When watching the trailer for The Matrix Resurrections, I was mesmerized by the neon code encircling Neo as he walked down the street, and in another scene, I could make out individual hairs on Neo’s beard as he stared up into the sun.\n\nDISPLAY\n1. Smaller notch makes the display a bit more immersive\n2. Slightly different button placement\n3. Pink and blue are standout colors\n4. New Green color launched March 2022\n\nCAMERA\n1. Bright and colorful images beat Samsung\n2. Ultra-wide camera delivers more scenes and improved Night mode\n3. Photographic styles give you creative control\n\nVIDEO\n1. Cinematic mode automatically changes focus on subjects while adding bokeh\n2. Superior Dolby Vision HDR video quality\n\nPERFORMANCE and A15 Bionic\n1.A15 Bionic is the fastest chip once again\n2. Machine learning performance notably better\n\nBATTERY LIFE\n1.10 hours and 33 minutes of battery life, which is 2 hours better than the iPhone 12\n\nSoftware\n1.SharePlay lets you watch videos and listen to music with friends\n2. Focus cuts down on distractions\n\nVERDICT :\nThe iPhone 13 improves on what was already the best iPhone for most people by introducing a bunch of welcome enhancements. I especially like the longer battery life, as the iPhone 12’s endurance was underwhelming even for a 5G phone. I wouldn’t recommend that iPhone 12 owners upgrade to the new iPhone, but the iPhone 13 is worth it if you own an iPhone 11 or older device.\n\nI don’t think many people will care about the smaller notch. What truly stands out on the iPhone 13 is the camera. The low-light performance is even better now, and computational photography features like Cinematic mode and Photographic styles flex the A15 Bionic’s muscles in ways that go way beyond benchmarks.\n\nI’m also glad Apple doubled the starting storage at 128GB, as that move was overdue and puts the new iPhone on par with Android flagships. I’d like to see Apple offering faster charging next time around — be it via USB-C or MagSafe — as well as a 120Hz display.\n\nThe bottom line is that the iPhone 13 is a fantastic phone and raises the bar for what you think a camera phone can do.\nRead more",
      "We're pretty confident when we say that the iPhone 13 is the best iPhone for most people. It may look like Apple has only changed the position of one of the phone's back cameras since last year's model, but trust us when we say that there are more substantial upgrades than that. With a new display, larger battery, and better camera hardware and software, the iPhone 13 is the new benchmark for flagship phones.\n\nOnce again, Apple's made the iPhone 13 far more powerful than its Android competitors thanks to its 5G-ready A15 Bionic chip. If the raw performance doesn't interest you, photographers can play with the new Photographic Style filters in the camera app, while videographers will be excited by the new Cinematic mode focus-racking ability.\n\nThe regular iPhone 13 has some flaws. The charging is still relatively slow compared to some Android phones. And I don't like that only the iPhone 13 Pro models get a 120Hz display and telephoto zoom. But based on my in-depth iPhone 13 review, this new iPhone is the best phone for the money.\n\nThe overall display quality continues to be stellar. When watching the trailer for The Matrix Resurrections, I was mesmerized by the neon code encircling Neo as he walked down the street, and in another scene, I could make out individual hairs on Neo’s beard as he stared up into the sun.\n\nDISPLAY\n1. Smaller notch makes the display a bit more immersive\n2. Slightly different button placement\n3. Pink and blue are standout colors\n4. New Green color launched March 2022\n\nCAMERA\n1. Bright and colorful images beat Samsung\n2. Ultra-wide camera delivers more scenes and improved Night mode\n3. Photographic styles give you creative control\n\nVIDEO\n1. Cinematic mode automatically changes focus on subjects while adding bokeh\n2. Superior Dolby Vision HDR video quality\n\nPERFORMANCE and A15 Bionic\n1.A15 Bionic is the fastest chip once again\n2. Machine learning performance notably better\n\nBATTERY LIFE\n1.10 hours and 33 minutes of battery life, which is 2 hours better than the iPhone 12\n\nSoftware\n1.SharePlay lets you watch videos and listen to music with friends\n2. Focus cuts down on distractions\n\nVERDICT :\nThe iPhone 13 improves on what was already the best iPhone for most people by introducing a bunch of welcome enhancements. I especially like the longer battery life, as the iPhone 12’s endurance was underwhelming even for a 5G phone. I wouldn’t recommend that iPhone 12 owners upgrade to the new iPhone, but the iPhone 13 is worth it if you own an iPhone 11 or older device.\n\nI don’t think many people will care about the smaller notch. What truly stands out on the iPhone 13 is the camera. The low-light performance is even better now, and computational photography features like Cinematic mode and Photographic styles flex the A15 Bionic’s muscles in ways that go way beyond benchmarks.\n\nI’m also glad Apple doubled the starting storage at 128GB, as that move was overdue and puts the new iPhone on par with Android flagships. I’d like to see Apple offering faster charging next time around — be it via USB-C or MagSafe — as well as a 120Hz display.\n\nThe bottom line is that the iPhone 13 is a fantastic phone and raises the bar for what you think a camera phone can do.",
      "I finally upgraded from my trusty iPhone 5s to the iPhone 13, and let me tell you, it feels like I’ve time-traveled from the past to the future! The pink color is absolutely gorgeous—it's the perfect blend of subtle and stylish, making the phone look sleek and modern. I’ve received so many compliments on it already.\n\nThe design is everything you’d expect from Apple: premium, well-crafted, and just a pleasure to hold. Coming from a 5s, it’s almost like I was using a rotary phone before this. I half-expected Siri to say, “Welcome to the 21st century!”\n\nThe display is bright and vibrant, the camera is a huge leap forward, and the overall performance is incredibly smooth. It’s crazy how much has changed—face ID feels like magic, and the battery life is a dream compared to my old 5s, which needed a charger practically glued to it.\n\nIf you’re thinking about upgrading, especially if you’re coming from a much older model like I was, don’t hesitate. This iPhone 13 in pink is a stunner and well worth the leap!"
    ],
    "last_scraped": 1757064662
  },
  "iphone 13||flipkart": {
    "reviews": [],
    "last_scraped": 1757064689
  },
  "poco x4||amazon": {
    "reviews": [
      "Excellent screen clarity. Smooth in hands. Total glass coating. Beautiful design. Fast charging. Nice camera performance. Really good phone. I don't play games.",
      "It does look promising as being one of the new generations of phones. Eye catching camera panel and classy design. Battery life is good with optimized usage of gaming. Qualcomm SM6375 Snapdragon 695 5G (6 nm): Octa-core (2x2.2 GHz Kryo 660 Gold & 6x1.7 GHz Kryo 660 Silver); Adreno 619 with Liquid Technology provides less latency. However some of theme features are not too great which one can modify by themselves. Speaker Output is not too great despite of being dual speaker phone, so not sure if Dolby Atmos is actually working. Video is capped at 1080...but I think its still AI...so 4K is not much required as off now in INDIA. Android 12 is expected with future updates. Its a worth buying mid range budget friendly phone following almost the same legacy of flagship phone POCO F1.",
      "Mobile was very good. Thanks to the seller for the good quality product.\nMobile:-\nCamera = good.\nNight vision= not great\nBattery= great backup\nCharging= super speed\nCons:-\n1)120hz refresh rate is quite strucks some times.using mobile with 90hz refresh rate\n2) insta reels are strucks many times.",
      "Good camera\nGood battery with fast charging\nSome problems in using 5g .VOlte stops working sometimes.\nOverall good phone.",
      "Very good",
      "Charger over heat performance not good mobile ki performance not good 15 minut Laga tha mere ko phone on karne mein mera phone on nahi ho raha tha jo maine new order Kiya hai poco x4 pro 5g is phone ka sound bahut jyada kam aata hai please my money refund",
      "Awesome smartphone for low mid range phone, works great , no lagging or anykind of cons, beside main camera other camera is average, you can do good quality of gaming , pubg works great on this phone , but can't play for too long it gets heated.\nOverall good phone.",
      "It's my review after 1 year of usage, no heat issues, even after continuous usage I could see charging capacity is gud, you can go for it. Ok with camera."
    ],
    "last_scraped": 1757064873
  },
  "poco x4||flipkart": {
    "reviews": [],
    "last_scraped": 1757065360
  },
  "iphone 16||amazon": {
    "reviews": [
      "Great device to have",
      "Good, user friendly , battery is good,",
      "Good camera. Iphone as always looks stunning especially in the new ultramarine color. Things to improve is battery life and definitely the outdated 60 Hz display. Feel in hand is far more better than s25 any variants. Also, initially ios 18 was having hiccups but ios 18.5 has got some smoothness in performance back. Prolonged gaming causes heating issue.\nSound quality is great btw.\nDefinitely samsung needs to improve camera and in hand feel of its s series flagship to be a better rival.",
      "Excellent",
      "excellent phone. looks beautiful too.",
      "Excellent performance. Easy & fast transfer of data from old phone to new phone",
      "Exciting phone using first time, thanks Apple",
      "Phone is good .but there charging cable is poor quality within 2 month charging cable is not working.bad quality of accessories",
      "Overall experience of the mobile phone is good but the phone was delivered with scratches which I think new phones should not have had any."
    ],
    "last_scraped": 1757065441
  },
  "iphone 16||flipkart": {
    "reviews": [],
    "last_scraped": 1757065467
  },
  "realme p3||amazon": {
    "reviews": [
      "Very good and nice price",
      "Best phone",
      "Overall all good performance and also good design. Value for money",
      "Ok",
      "Littel heating issue in my smartphone unit 😔",
      "Good",
      "A good choice for the price\nReal value for money",
      "Awesome"
    ],
    "last_scraped": 1757065516
  },
  "realme p3||flipkart": {
    "reviews": [],
    "last_scraped": 1757065542
  },
  "poco x5||amazon": {
    "reviews": [
      "Excellent",
      "Been using it for more than a month the phone is kind of good for gaming and is smooth, the display also has a 120 Hz refresh rate, the storage has quite the capacity at 256 gb, charging rate was 13 percent in 8 minutes and to 25 percent in 14 minutes so it is quite fast, and the phone is quite smooth no problems as of now, sound quality is also decent, the only thing I would note is camera is good during the day but during night it still improvement would not recommend for those who want good camera quality.Overall am satisfied with the phone.",
      "A very good mobile phone loaded with many features. Camera quality, battery backup, fast charging all are very nice. Also, to top up is AMOLED display.",
      "Baki sab thik hai but camera is not good Kam chalu hai",
      "Automatic on off hota rahta hai,jab maine apna id is mobile me active kiya or uske baad Gmail ka active session dekha to kisi apple ke laptop me bhi active ho gya,jisse kaha ja skta hai ki security bilkul bhi nhi hai..... network connectivity bahut weak hai.....or jb mai ise replace krna chahta hu to 1 week se bta raha hai ki ye mobile abhi stock me nhi hai.....mtlb aapke paas jaisa bhi ho,use koi mtlb nhi.....mera sujhaav hai ye mobile kisi bhi angle se theek nhi hai....",
      "Value for money specs and smooth operations, camera is a big let down ..grainy images.",
      "Every aspects working well",
      "It seems good product in this price of ₹14500 but at the time of delivery and exchange my old phone, vendor demanded more money. My above said opinion became changed."
    ],
    "last_scraped": 1757065732
  },
  "poco x5||flipkart": {
    "reviews": [],
    "last_scraped": 1757065757
  },
  "poco x2||amazon": {
    "reviews": [
      "Good fiting to mobile, quality is good one, nice colour love it.\nThanks..",
      "Solid",
      "Very good product.. material is very good",
      "Cover feels smooth, good grip but just the camera holes are not aligned properly in case of Wide angle Camera and while using flash it leaves green shade at the corner for Main Camera.",
      "Nice cover",
      "Best quality in this price range ✅",
      "Very good product. Product quality very good. Nice product",
      "Good case with grip\nNice n classy too 😌"
    ],
    "last_scraped": 1757066077
  },
  "poco x2||flipkart": {
    "reviews": [],
    "last_scraped": 1757066101
  },
  "realme p1||amazon": {
    "reviews": [
      "The phone is good. After 6 months use I am writing review. Phone perform fast, good battery backup, display vivid and bright, sound also loud, does not heat up in normal use. Only problem is it sometimes lag. Otherwise good camera, good performance phone. I like it 👍👍👍👍.",
      "This device offers excellent value for its price. It features a sleek design, a smooth-performing Dimensity 7050 5G processor, and a vibrant 120Hz AMOLED display. The camera quality is impressive for its category, making it a well-rounded choice for budget-conscious buyers.",
      "Phone is good, perfect and very nice\nGood price\nSupervooc charger is very very fast charging and it is super charger\nBattery life is satisfied and good\nQuality and brand is perfect combination\nSuper phone for budget friendly 👏👏",
      "Phone speed ok.. Worest cameras no clarity..",
      "Nice phone.",
      "The Realme P1 5G is a powerhouse of a smartphone, boasting a 120Hz AMOLED display, MediaTek Dimensity 7050 chipset, and a massive 5000mAh battery with 45W charging.\n\nIn terms of performance, the Realme P1 5G is a beast, with the MediaTek Dimensity 7050 chipset providing lightning-fast speeds and efficient battery life ¹. The phone also features up to 8GB of RAM and 256GB of storage, making it perfect for gaming and multitasking.\n\nThe display is another highlight of the phone, with a bright and vibrant 6.67-inch AMOLED screen that's perfect for watching videos and browsing the web ¹. The 120Hz refresh rate also makes for smooth scrolling and gaming.\n\nBattery life is also impressive, with the 5000mAh battery easily lasting a day and a half with heavy use ¹. The 45W charging also means you can quickly top up your battery when you're on the go.\n\nHowever, the camera is a bit of a letdown, with subpar low-light photography and no optical image stabilization ¹. But overall, the Realme P1 5G is an excellent choice for anyone looking for a powerful and feature-packed smartphone without breaking the bank.\nRead more",
      "The Realme P1 5G is a powerhouse of a smartphone, boasting a 120Hz AMOLED display, MediaTek Dimensity 7050 chipset, and a massive 5000mAh battery with 45W charging.\n\nIn terms of performance, the Realme P1 5G is a beast, with the MediaTek Dimensity 7050 chipset providing lightning-fast speeds and efficient battery life ¹. The phone also features up to 8GB of RAM and 256GB of storage, making it perfect for gaming and multitasking.\n\nThe display is another highlight of the phone, with a bright and vibrant 6.67-inch AMOLED screen that's perfect for watching videos and browsing the web ¹. The 120Hz refresh rate also makes for smooth scrolling and gaming.\n\nBattery life is also impressive, with the 5000mAh battery easily lasting a day and a half with heavy use ¹. The 45W charging also means you can quickly top up your battery when you're on the go.\n\nHowever, the camera is a bit of a letdown, with subpar low-light photography and no optical image stabilization ¹. But overall, the Realme P1 5G is an excellent choice for anyone looking for a powerful and feature-packed smartphone without breaking the bank.",
      "This phone has a sleek design but battery doesn't stays for too long. If you are an average user meaning not heavy usage like gaming,reels etc then it would stay for one day. Performance is as good as new after 7 months of its use.",
      "Budget friendly performance phone.value for money."
    ],
    "last_scraped": 1757081110
  },
  "realme p1||flipkart": {
    "reviews": [],
    "last_scraped": 1757082079
  },
  "nothing phone 3a||amazon": {
    "reviews": [
      "If I were to give a “grade” for videography (for its price segment), here’s how I’d rate:\nAspect\nRating (out of 10)\nNotes\nMain camera, daylight video\n~8/10\nSharp, good detail, good stabilization in stable conditions.\nTelephoto zoom video\n~7/10\nUseful and decent, but limitations at higher zoom / lower light.\nUltra-wide video\n~6/10\nGood for wide shots but loses detail + struggles more.\nLow light video\n~5-6/10\nOK when steady and aided by some lighting, but noise, focus, color issues show.\nAutofocus & stabilization while moving\n~6/10\nDecent, but not perfect; improvements needed.\nMixed heavy usage (calls + messaging + gaming + streaming + browsing) over a full day\n20-24 hours before recharge needed. �\nIt can get through a full day even if you use it well. You won’t need to recharge midday if you’re moderate-to-heavy.\nBusiness Today +2\nPCMark battery test (simulated mixed use)\n~17h 40m of “work” usage until battery drops to 20%. �\nThis is very good for a mid-range device; shows solid optimization.\nIndia TV News +1\nContinuous display / active use in lab tests\n~13h 32m (active use score in GSM Arena). �\nIf you use screen heavily (video, web, etc.), this gives a realistic idea.\nGSMArena +1\nScreen-on time in user testing (heavy gaming + social media + benchmarks)\n~7 hours SOT under heavy usage. �\n\nNothing Community\nScreen-on time in lighter usage (mostly browsing, social media, calls, low-intensity tasks)\nUp to ~9 hours SOT. �\nOverall Value Score (Subjective)\nIf I were to rate it out of 10 for value for money at ₹23,299:\nFor general users / daily use: 8.5/10 — excellent value.\nFor gamers / camera enthusiasts: maybe 7/10 — good, but you may wish for more in certain areas.\nVerdict: Should You Buy at ₹23,299?\nYes — if your priorities are balanced: good display, decent camera, nice design, reliable battery, and you don’t need flagship-level extremes (super fast charging, perfect ultra-wide shots, maxed-out performance under long heavy load).\nIf your budget is tight around this number, this is one of the stronger choices. If you can stretch a bit or wait for deals, you might snag a rival that has faster charging or a stronger ultra-wide camera. But overall, for most users, this phone offers more good than compromise at around ₹23,299\nRead more",
      "If I were to give a “grade” for videography (for its price segment), here’s how I’d rate:\nAspect\nRating (out of 10)\nNotes\nMain camera, daylight video\n~8/10\nSharp, good detail, good stabilization in stable conditions.\nTelephoto zoom video\n~7/10\nUseful and decent, but limitations at higher zoom / lower light.\nUltra-wide video\n~6/10\nGood for wide shots but loses detail + struggles more.\nLow light video\n~5-6/10\nOK when steady and aided by some lighting, but noise, focus, color issues show.\nAutofocus & stabilization while moving\n~6/10\nDecent, but not perfect; improvements needed.\nMixed heavy usage (calls + messaging + gaming + streaming + browsing) over a full day\n20-24 hours before recharge needed. �\nIt can get through a full day even if you use it well. You won’t need to recharge midday if you’re moderate-to-heavy.\nBusiness Today +2\nPCMark battery test (simulated mixed use)\n~17h 40m of “work” usage until battery drops to 20%. �\nThis is very good for a mid-range device; shows solid optimization.\nIndia TV News +1\nContinuous display / active use in lab tests\n~13h 32m (active use score in GSM Arena). �\nIf you use screen heavily (video, web, etc.), this gives a realistic idea.\nGSMArena +1\nScreen-on time in user testing (heavy gaming + social media + benchmarks)\n~7 hours SOT under heavy usage. �\n\nNothing Community\nScreen-on time in lighter usage (mostly browsing, social media, calls, low-intensity tasks)\nUp to ~9 hours SOT. �\nOverall Value Score (Subjective)\nIf I were to rate it out of 10 for value for money at ₹23,299:\nFor general users / daily use: 8.5/10 — excellent value.\nFor gamers / camera enthusiasts: maybe 7/10 — good, but you may wish for more in certain areas.\nVerdict: Should You Buy at ₹23,299?\nYes — if your priorities are balanced: good display, decent camera, nice design, reliable battery, and you don’t need flagship-level extremes (super fast charging, perfect ultra-wide shots, maxed-out performance under long heavy load).\nIf your budget is tight around this number, this is one of the stronger choices. If you can stretch a bit or wait for deals, you might snag a rival that has faster charging or a stronger ultra-wide camera. But overall, for most users, this phone offers more good than compromise at around ₹23,299",
      "This is the best phone I have ever used till today. Bought it on October 30th less than a week and I am loving the experience. The cameras are good. After looking at the quality I will take pictures wantedly. The OS is simply minimal and very very user friendly. More features can be added which I am sure nothing will bring down the line with software updates. I don't play any games and for normal activities there is no heating issue and even though I restricted the batter limit to 80% I am still being left with around 20-30 percent charge on daily usage of 8-9 hrs of screen time. The display quality and the touch quality are great.\nAnd coming to storage type.\n3a uses UFS 2.2 while other mobiles in the same range use 3.1 u might think that it's a big difference and choose not to get nothing phone but nothing has optimised the OS and the hardware and software are so In tune that it performs better than UFS 3.1 in random daily tasks.\nOverall a solid investment in budget range smartphones.",
      "Reviewing after a couple of weeks of usage\n\nThings I liked:\n\nThe chassis feels well-built and sturdy, though not tough enough — a protective cover is definitely recommended.\n\nThe overall look and design are great.\n\nThe base Nothing OS is smooth and stable, though the firmware seems to need a few updates and patches for better optimization.\n\nSound quality is impressive — both the earpiece and speaker perform really well during calls, and media playback is loud and clear.\n\nThe camera is truly good for a 50MP setup with handy pro features; night mode is decent too.\n\nThings I didn’t like:\n\nAt this price point, a charger adapter/brick should have been included.\n\nCall recording is not available natively — requires third-party apps.\n\nThere’s no built-in app lock feature, so you either rely on the main lock screen or use external apps for security.\n\nOverall:\nA good phone with impressive looks, camera, and sound quality. However, missing out on some basic and essential features at this price range (around ₹25k–₹28k) does make it feel slightly incomplete.\nRead more",
      "Reviewing after a couple of weeks of usage\n\nThings I liked:\n\nThe chassis feels well-built and sturdy, though not tough enough — a protective cover is definitely recommended.\n\nThe overall look and design are great.\n\nThe base Nothing OS is smooth and stable, though the firmware seems to need a few updates and patches for better optimization.\n\nSound quality is impressive — both the earpiece and speaker perform really well during calls, and media playback is loud and clear.\n\nThe camera is truly good for a 50MP setup with handy pro features; night mode is decent too.\n\nThings I didn’t like:\n\nAt this price point, a charger adapter/brick should have been included.\n\nCall recording is not available natively — requires third-party apps.\n\nThere’s no built-in app lock feature, so you either rely on the main lock screen or use external apps for security.\n\nOverall:\nA good phone with impressive looks, camera, and sound quality. However, missing out on some basic and essential features at this price range (around ₹25k–₹28k) does make it feel slightly incomplete.",
      "Excellent phone in terms of performance, battery, smooth touch, and very good sound. Camera quality is also good but it could be more better.",
      "Amazing camera phone 😊😊best performance display quality design feel features &battery life bhut mast h yrr",
      "It's an excellent device with good camera the only drawback is that it is limited to 4k 30 fps",
      "Awesome mobile. Charging speed is good. Performance wise is awesome. Different nothing interface than adroids and iphones.\nUnexpected things as compared to other andoirds - has inbuilt feature of checking battery level for airpods as well as taking motion pictures just like live photos feature of iphones. ( There are other unique features which are specific to Nothing)\n\nTotally liked it.",
      "The Nothing Phone 3a looks cool with its transparent back and lights. The screen is big and smooth, and the phone works fast for daily use. Photos come out clear, and the battery lasts all day. It charges quickly too (but charger not included).\n\nPros: Stylish design, good display, fast performance, clean software\nCons: No headphone jack, no charger in the box\n\nOverall, a great value phone that feels premium.",
      "Très rapide, pas de bloatware contrairement aux autres marques Android, super appareil photo, et plusieurs fonctionnalités IA plus ou moins utiles.",
      "works with mint mobile, so far so good, best phone ive had, no bloat, goofy lights",
      "No bloatware and clean UI. Good camera comparable with iPhone and good sound also.\nNever been happier with a new phone than with the 3a.",
      "Great phone apart from Battery life.",
      "Quick delivery , good price"
    ],
    "last_scraped": 1761062847
  },
  "nothing phone 3a||flipkart": {
    "reviews": [],
    "last_scraped": 1761062886
  }
}